Makerfabs/ESP32-S3-Parallel-TFT-with-Touch-4.3inch/examples/ESP-IDF/squareline/sdkconfig.defaults
#
# Automatically generated file. DO NOT EDIT.
# Espressif IoT Development Framework (ESP-IDF) 5.4.2 Project Configuration
#

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_FREERTOS_HZ=1000


CONFIG_ESP32S3_SPIRAM_SUPPORT=y

CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_USE_FLOAT=y

CONFIG_BOARD_TYPE_4_3_UNKNOWN_GT911=y
CONFIG_DEVELOPMENT_MODE_RELEASE=y


# End of deprecated options
